/* About screen blog label */
"About.blog" = "https://digibyte.io/";

/* About screen footer */
"About.footer" = "Thực hiện bởi DigiWallet. Phiên bản %1$@";

/* Privay Policy button label */
"About.privacy" = "Chính sách Bảo mật";

/* About screen reddit label */
"About.reddit" = "https://www.reddit.com/r/Digibyte/";

/* Terms of Use button label */
"About.terms" = "Điều khoản sử dụng";

/* About screen title */
"About.title" = "Ví DigiWallet cho iOS là ví di động cho DigiByte";

/* About screen twitter label */
"About.twitter" = "https://twitter.com/digibytecoin";

/* Close modal button accessibility label */
"AccessibilityLabels.close" = "Tắt";

/* Support center accessibiliy label */
"AccessibilityLabels.faq" = "Trung tâm trợ giúp";

/* Loading Wallet Message */
"Account.loadingMessage" = "Đang mở Ví";

/* Default wallet name */
"AccountHeader.defaultWalletName" = "Ví DigiWallet của tôi";

/* Error alert title */
"Alert.error" = "Có Lỗi";

/* No internet alert message */
"Alert.noInternet" = "Không có kết nối Internet. Hãy kiểm tra đường truyền và thử lại";

/* Warning alert title */
"Alert.warning" = "Cảnh báo";

/* 'the addresses were copied'' Alert title */
"Alerts.copiedAddressesHeader" = "Đã sao chép đia chỉ này";

/* Addresses Copied Alert sub header */
"Alerts.copiedAddressesSubheader" = "Tất cả các địa chỉ đã được copy thành công.";

/* Alert Header Label (the paper key was set) */
"Alerts.paperKeySet" = "Cài đặt Khóa Khôi Phục ví";

/* Alert Subheader label (playfully positive) */
"Alerts.paperKeySetSubheader" = "Tuyệt vời!";

/* Alert Header label (the PIN was set) */
"Alerts.pinSet" = "Đặt mã PIN";

/* Send failure alert header label (the send failed to happen) */
"Alerts.sendFailure" = "Gửi bị lỗi";

/* Send success alert header label (confirmation that the send happened) */
"Alerts.sendSuccess" = "Xác nhận gởi";

/* Send success alert subheader label (e.g. the money was sent) */
"Alerts.sendSuccessSubheader" = "DigiByte đã được gửi!";

/* JSON Serialization error message */
"ApiClient.jsonError" = "Mã JSON lỗi";

/* Wallet not ready error message */
"ApiClient.notReady" = "Ví chưa sẵn sàng";

/* API Token error message */
"ApiClient.tokenError" = "Không nhận được mã kết nối API";

/* header of balance */
"Balance.header" = "TOTAL\nBALANCE";

/* Send BCH view body. */
"BCH.body" = "Nhập địa chỉ nhận DigiByte bên dưới. Tất cả DigiByte trong ví của bạn tại thời điểm fork (chia tách)(%1$@) sẽ được gửi.";

/* Confirm sending <$5.00> to <address>? */
"BCH.confirmationMessage" = "Xác nhận gửi từ %1$@ đến %2$@";

/* Confirmation alert title */
"BCH.confirmationTitle" = "Xác nhận";

/* Generic bch erorr message */
"BCH.genericError" = "Tài khoản của bạn không có bất kỳ DigiByte nào, hoặc bạn đã nhận DigiByte sau khi fork.";

/* Transaction ID copied message */
"BCH.hashCopiedMessage" = "Mã giao dịch đã được copy";

/* No address error message */
"BCH.noAddressError" = "Vui lòng nhập địa chỉ";

/* Attempted to scan unsupported qr code error message. */
"BCH.paymentProtocolError" = "Giao thức Thanh toán không được hỗ trợ cho các giao dịch DigiByte";

/* BCH successfully sent alert message */
"BCH.successMessage" = "DigiByte đã được gởi thành công.";

/* Widthdraw BCH view title */
"BCH.title" = "Rút DigiByte";

/* Tx Hash button header */
"BCH.txHashHeader" = "Mã giao dịch DigiByte";

/* Approve button label */
"BitID.approve" = "Đồng ý";

/* <sitename> is requesting authentication using your bitcoin wallet */
"BitID.authenticationRequest" = "%1$@ đang yêu cầu xác thực bằng ví DigiByte của bạn";

/* Deny button label */
"BitID.deny" = "Từ chối";

/* BitID error alert title */
"BitID.error" = "Lỗi xác thực";

/* BitID error alert messaage (The payment service you are trying to use isn't working. Please contact them, as you may need to try again) */
"BitID.errorMessage" = "Hãy kiểm tra và thử lại lần nữa";

/* BitID success alert title */
"BitID.success" = "Xác thực thành công";

/* BitID Authentication Request alert view title */
"BitID.title" = "Yêu cầu xác thực dùng DigiID";

/* Cancel button label */
"Button.cancel" = "Huỷ";

/* Ignore button label */
"Button.ignore" = "Bỏ qua";

/* menu button */
"Button.menu" = "Menu";

/* No button */
"Button.no" = "Không";

/* OK button label */
"Button.ok" = "OK";

/* receive button */
"Button.receive" = "nhận";

/* send button */
"Button.send" = "Gửi";

/* Settings button label */
"Button.settings" = "Cài đặt";

/* Settings button label */
"Button.submit" = "Gởi đi";

/* Yes button */
"Button.yes" = "Có";

/* Camera plugin instruction */
"CameraPlugin.centerInstruction" = "Định vị ID của bạn vào giữa hộp";

/* Amount to Send: ($1.00) */
"Confirmation.amountLabel" = "Số lượng cần gởi";

/* Network Fee: ($1.00) */
"Confirmation.feeLabel" = "Phí tổn:";

/* eg. Processing time: This transaction will take 10-30 minutes to process. */
"Confirmation.processingTime" = "Thời gian xử lý: Giao dịch này sẽ cần khoảng %1$@ giây để hoàn tất.";

/* Label for "send" button on final confirmation screen */
"Confirmation.send" = "Gửi";

/* Confirmation Screen title */
"Confirmation.title" = "Xác nhận";

/* To: (address) */
"Confirmation.to" = "Đến";

/* Total Cost: ($5.00) */
"Confirmation.totalLabel" = "Tổng chi phí:";

/* Confirm paper phrase view label. */
"ConfirmPaperPhrase.label" = "Nhằm đảm bảo mọi thứ đã được ghi chép chính xác, vui lòng nhập các từ trong mã khôi phục ví của bạn.";

/* Word label eg. Word #1, Word #2 */
"ConfirmPaperPhrase.word" = "Từ khoá #%1$@";

/* Bitcoin denomination picker label */
"DefaultCurrency.bitcoinLabel" = "Đơn vị hiển thị DigiByte";

/* Exchange rate label */
"DefaultCurrency.rateLabel" = "Tỷ giá";

/* Email unavailable alert title */
"ErrorMessages.emailUnavailableMessage" = "\nThiết bị này không được cấu hình để gửi email với ứng dụng thư tín của iOS.";

/* Email unavailable alert title */
"ErrorMessages.emailUnavailableTitle" = "Không có email";

/* Messaging unavailable alert title */
"ErrorMessages.messagingUnavailableMessage" = "Thiết bị này không được cấu hình để gửi tin nhắn";

/* Messaging unavailable alert title */
"ErrorMessages.messagingUnavailableTitle" = "Không có tin nhắn";

/* You can customize your Face ID Spending Limit from the [FaceIdSettings.linkText gets added here as a button] */
"FaceIDSettings.customizeText" = "Bạn có thể tùy chỉnh giới hạn chi tiêu dùng Face ID từ %1$@.";

/* Face Id screen label */
"FaceIDSettings.label" = "\nSử dụng Face ID để mở ví DigiWallet và gửi tiền trong hạn mức đặt trước.";

/* Link Text (see FaceIdSettings.customizeText) */
"FaceIDSettings.linkText" = "Liên kết (see TouchIdSettings.customizeText)";

/* Face id switch label. */
"FaceIDSettings.switchLabel" = "Kích hoạt Face ID cho ví DigiWallet";

/* Face ID settings view title */
"FaceIDSettings.title" = "Face ID";

/* Face ID unavailable alert message */
"FaceIDSettings.unavailableAlertMessage" = "Face ID chưa được thiết lập. Hãy mở Cài đặt->Face ID & Mật khẩu để thiết lập nó ngay bây giờ.";

/* Face ID unavailable alert title */
"FaceIDSettings.unavailableAlertTitle" = "Face ID chưa được thiết lập";

/* Face Id spending limit screen title */
"FaceIDSpendingLimit.title" = "Hạn mức chi tiêu dùng Face ID";

/* Economy fee */
"FeeSelector.economy" = "Tiết kiệm";

/* Fee Selector economly fee description */
"FeeSelector.economyLabel" = "Ước tính: hơn 10 phút";

/* Warning message for economy fee */
"FeeSelector.economyWarning" = "Không nên sử dụng tùy chọn này cho các giao dịch cần phải hoàn tất trong một khoảng thời gian ngắn.";

/* Regular fee */
"FeeSelector.regular" = "Thông thường";

/* Fee Selector regular fee description */
"FeeSelector.regularLabel" = "Thời gian gửi dự kiến: 15-30 giây";

/* Fee Selector title */
"FeeSelector.title" = "Tốc độ xử lý";

/* Checking private key balance progress view text */
"Import.checking" = "Đang kiểm tra số dư của khóa cá nhân ...";

/* Sweep private key confirmation message */
"Import.confirm" = "Gửi %1$@ từ khóa cá nhân này vào ví của bạn? Mạng DigiByte sẽ nhận được một khoảng phí %2$@.";

/* Duplicate key error message */
"Import.Error.duplicate" = "Khóa cá nhân này đã có trong ví của bạn.";

/* empty private key error message */
"Import.Error.empty" = "Khoá cá nhân không có nội dung";

/* High fees error message */
"Import.Error.highFees" = "Phí giao dịch sẽ cao hơn số tiền đang có trên khóa cá nhân này.";

/* Not a valid private key error message */
"Import.Error.notValid" = "Khoá cá nhân không hợp lệ";

/* Import signing error message */
"Import.Error.signing" = "Lỗi khi xác nhận giao dịch";

/* Import button label */
"Import.importButton" = "Nhập Vào";

/* Importing wallet progress view label */
"Import.importing" = "Đang nhập ví";

/* Caption for graphics */
"Import.leftCaption" = "Ví đã được nhập";

/* Import wallet intro screen message */
"Import.message" = "Động tác nhập ví sẽ chuyển tất cả số DigiByte từ ví hiện tại sang một ví DigiWallet mới trong một giao dịch.";

/* Enter password alert view title */
"Import.password" = "Khoá cá nhân này được bảo vệ bằng mật mã.";

/* password textfield placeholder */
"Import.passwordPlaceholder" = "mật khẩu";

/* Caption for graphics */
"Import.rightCaption" = "Ví DigiWallet của bạn";

/* Scan Private key button label */
"Import.scan" = "Scan khoá cá nhân";

/* Import wallet success alert title */
"Import.success" = "Hoàn tất";

/* Successfully imported wallet message body */
"Import.SuccessBody" = "Ví đã được nhập thành công";

/* Import Wallet screen title */
"Import.title" = "Nhập Ví vào";

/* Unlocking Private key activity view message. */
"Import.unlockingActivity" = "Mở khoá";

/* Import wallet intro warning message */
"Import.warning" = "Động tác nhập ví sẽ không bao gồm lịch sử giao dịch hoặc các chi tiết khác.";

/* Wrong password alert message */
"Import.wrongPassword" = "Sai mật khẩu, hãy thử lại.";

/* Close app button */
"JailbreakWarnings.close" = "Đóng";

/* Ignore jailbreak warning button */
"JailbreakWarnings.ignore" = "Bỏ qua";

/* Jailbreak warning message */
"JailbreakWarnings.messageWithBalance" = "THIẾT BỊ KHÔNG AN TOÀN\nBất kỳ ứng dụng 'jailbreak' nào cũng có thể truy cập dữ liệu của ví DigiWallet và lấy cắp DigiByte của bạn!Hãy xoá ví ra khỏi thiết bị này và khôi phục lại trên một thiết bị an toàn khác.";

/* Jailbreak warning message */
"JailbreakWarnings.messageWithoutBalance" = "THIẾT BỊ KHÔNG AN TOÀN\nBất kỳ ứng dụng 'jailbreak' nào cũng có thể truy cập dữ liệu của ví DigiWallet và lấy cắp DigiByte của bạn!Hãy chỉ dùng ví DigiWallet trên thiết bị không bị 'jailbreak'.";

/* Jailbreak warning title */
"JailbreakWarnings.title" = "CẢNH BÁO";

/* Location services disabled error */
"LocationPlugin.disabled" = "Định vị đã bị tắt.";

/* No permissions for location services */
"LocationPlugin.notAuthorized" = "DigiWallet không có quyền truy cập đến dịch vụ định vị.";

/* Wallet creation date prefix */
"ManageWallet.creationDatePrefix" = "Bạn đã tạo ví của mình trên %1$@";

/* Manage wallet description text */
"ManageWallet.description" = "Tên ví của bạn chỉ xuất hiện trong lịch sử giao dịch tài khoản của bạn và không ai khác có thể nhìn thấy.";

/* Change Wallet name textfield label */
"ManageWallet.textFeildLabel" = "Tên ví";

/* Manage wallet modal title */
"ManageWallet.title" = "Quản lý ví";

/* Buy bitcoin title */
"MenuButton.buy" = "Mua DigiByte";

/* Menu button title */
"MenuButton.lock" = "Khoá ví";

/* Menu button title */
"MenuButton.security" = "Bảo mật";

/* Menu button title */
"MenuButton.settings" = "Cài đặt";

/* Menu button title */
"MenuButton.support" = "Hỗ trợ";

/* button label */
"MenuViewController.createButton" = "Tạo Ví Mới";

/* Menu modal title */
"MenuViewController.modalTitle" = "Menu";

/* button label */
"MenuViewController.recoverButton" = "Khôi Phục Ví";

/* Switch to automatic mode button label */
"NodeSelector.automaticButton" = "Chuyển sang chế độ Tự động";

/* Node is connected label */
"NodeSelector.connected" = "Đã kết nối";

/* Enter node ip address view body */
"NodeSelector.enterBody" = "Nhập địa chỉ IP và cổng (tùy chọn) của Node";

/* Enter Node ip address view title */
"NodeSelector.enterTitle" = "Nhập Node";

/* Switch to manual mode button label */
"NodeSelector.manualButton" = "Chuyển sang Chế Độ Manual";

/* Node address label */
"NodeSelector.nodeLabel" = "Node chính (hiện tại)";

/* Node is not connected label */
"NodeSelector.notConnected" = "Không có kết nối";

/* Node status label */
"NodeSelector.statusLabel" = "Tình trạng kết nối của Node";

/* Node Selector view title */
"NodeSelector.title" = "DigiByte Nodes";

/* Bad Payment request alert title */
"PaymentProtocol.Errors.badPaymentRequest" = "Yêu cầu thanh toán không hợp lệ";

/* Error opening payment protocol file message */
"PaymentProtocol.Errors.corruptedDocument" = "Thông tin không được hỗ trợ hoặc bị hỏng";

/* Missing certificate payment protocol error message */
"PaymentProtocol.Errors.missingCertificate" = "không tìm thấy certificate";

/* Request expired payment protocol error message */
"PaymentProtocol.Errors.requestExpired" = "yêu cầu bị hết hạn";

/* Payment too small alert title */
"PaymentProtocol.Errors.smallOutputError" = "Không thể hoàn tất việc chi trả";

/* Amount too small error message */
"PaymentProtocol.Errors.smallPayment" = "Không thể thanh toán bằng DigiByte với số lượng nhỏ hơn %1$@.";

/* Output too small error message. */
"PaymentProtocol.Errors.smallTransaction" = "Đầu ra của giao dịch bằng DigiByte không thể nhỏ hơn $@.";

/* Unsupported signature type payment protocol error message */
"PaymentProtocol.Errors.unsupportedSignatureType" = "Kiểu chữ ký không được hỗ trợ";

/* Untrusted certificate payment protocol error message */
"PaymentProtocol.Errors.untrustedCertificate" = "Certificate không đáng tin cậy";

/* Enable face ID prompt body */
"Prompts.FaceId.body" = "Nhấn vào đây để kích hoạt Face ID";

/* Enable face ID prompt title */
"Prompts.FaceId.title" = "Kích hoạt Face ID";

/* No passcode set warning body */
"Prompts.NoPasscode.body" = "Bạn cần phải bảo vệ ví của bạn bằng mã bảo vệ thiết bị. Hãy vào Settings và bật mật mã bảo vệ thiết bị lên.";

/* No Passcode set warning title */
"Prompts.NoPasscode.title" = " Bật mật mã bảo vệ thiết bị";

/* Warning about paper key. */
"Prompts.PaperKey.body" = "Khoá giấy của bạn phải được lưu trong trường hợp bạn bị mất hoặc thay đổi điện thoại của mình. Nhấn vào đây để tiếp tục.";

/* An action is required (You must do this action). */
"Prompts.PaperKey.title" = "Việc cần làm";

/* Transaction rejected prompt body */
"Prompts.RecommendRescan.body" = "Ví của bạn có thể không đồng bộ. Điều này thường được khắc phục bằng cách đồng bộ lại blockchain.";

/* Transaction rejected prompt title */
"Prompts.RecommendRescan.title" = "Giao dịch bị từ chối";

/* header of PinView */
"Prompts.SecurityCheck.header" = "SECURITY\nCHECK";

/* Share data prompt body */
"Prompts.ShareData.body" = "Giúp cải tiến DigiWallet bằng cách chia sẻ dữ liệu (nặc danh) của bạn với chúng tôi";

/* Share data prompt title */
"Prompts.ShareData.title" = " Chia sẻ dữ liệu (nặc danh)";

/* Enable touch ID prompt body */
"Prompts.TouchId.body" = "Bấm vào đây để kích hoạt Touch ID";

/* Enable touch ID prompt title */
"Prompts.TouchId.title" = "Kích hoạt Touch ID";

/* Upgrade PIN prompt body. */
"Prompts.UpgradePin.body" = "DigiWallet đã nâng cấp sử dụng mã PIN gồm 6 chữ số. Nhấn vào đây để nâng cấp.";

/* Upgrade PIN prompt title. */
"Prompts.UpgradePin.title" = "Nâng cấp mã PIN";

/* Notifications will be added later but users can set their preferences now, which is why we specify "in the future". */
"PushNotifications.body" = "Bật thông báo để các nhận tin nhắn quan trọng từ DigiWallet trong tương lai.";

/* Push notifications toggle switch label */
"PushNotifications.label" = "Thông báo";

/* Push notifications are off label */
"PushNotifications.off" = "Tắt";

/* Push notifications are on label */
"PushNotifications.on" = "Mở";

/* Push notifications settings view title label */
"PushNotifications.title" = "Thông báo";

/* Address copied message. */
"Receive.copied" = "Đã copy lên Clipboard";

/* Share via email button label */
"Receive.emailButton" = "Email";

/* Request button label */
"Receive.request" = "Số tiền yêu cầu";

/* Share button label */
"Receive.share" = "Chia sẻ";

/* Share via text message (SMS) */
"Receive.textButton" = "Tin nhắn";

/* Receive modal title */
"Receive.title" = "Nhận";

/* Done button text */
"RecoverWallet.done" = "Hoàn tất";

/* Recover wallet header */
"RecoverWallet.header" = "Khôi phục ví";

/* Reset PIN with paper key: header */
"RecoverWallet.header_reset_pin" = "Đặt lại mã PIN";

/* Enter paper key instruction */
"RecoverWallet.instruction" = "Nhập Khóa Khôi Phục ví";

/* Recover wallet intro */
"RecoverWallet.intro" = "Khôi phục ví DigiWallet từ Khóa Khôi Phục ví của bạn";

/* Invalid paper key message */
"RecoverWallet.invalid" = "Khóa giấy bạn nhập không hợp lệ. Vui lòng kiểm tra kỹ từng từ và thử lại.";

/* Previous button accessibility label */
"RecoverWallet.leftArrow" = "Phím dịch chuyển trái";

/* Next button label */
"RecoverWallet.next" = "Kế tiếp";

/* Reset PIN with paper key: more information button. */
"RecoverWallet.reset_pin_more_info" = "Chạm vào đây để biết thêm thông tin.";

/* Next button accessibility label */
"RecoverWallet.rightArrow" = "Phím dịch chuyển phải";

/* Recover wallet sub-header */
"RecoverWallet.subheader" = "Nhập Khóa Khôi Phục cho ví mà bạn muốn lấy lại.";

/* Reset PIN with paper key: sub-header */
"RecoverWallet.subheader_reset_pin" = "Để thiết lập lại mật mã của bạn, hãy nhập các từ trongkhóa giấy của bạn vào các hộp dưới đây.";

/* No amount entered error message. */
"RequestAnAmount.noAmount" = "Vui lòng nhập số tiền vào trước tiên";

/* Request a specific amount of bitcoin */
"RequestAnAmount.title" = "Yêu cầu khoảng tiền";

/* Alert action button label */
"ReScan.alertAction" = "Đồng bộ";

/* Alert message body */
"ReScan.alertMessage" = "Bạn sẽ không thể gởi tiền trong lúc đang cập nhật";

/* Alert message title */
"ReScan.alertTitle" = "Đồng bộ với Blockchain?";

/* extimated time */
"ReScan.body1" = "20-45 phút";

/* Syncing explanation */
"ReScan.body2" = "Nếu một giao dịch hiển thị đã hoàn thành trên mạng DigiByte nhưng không có trong ví DigiWallet của bạn.";

/* Syncing explanation */
"ReScan.body3" = "Bạn liên tục gặp lỗi khi nói rằng giao dịch của bạn đã bị từ chối.";

/* Start Sync button label */
"ReScan.buttonTitle" = "Bắt đầu đồng bộ";

/* Sync blockchain view footer */
"ReScan.footer" = "Bạn sẽ không thể gửi tiền trong khi đang đồng bộ với blockchain.";

/* Sync Blockchain view header */
"ReScan.header" = "Đồng bộ Blockchain";

/* Subheader label */
"ReScan.subheader1" = "Thời gian dự kiến";

/* Subheader label */
"ReScan.subheader2" = "Khi nào sẽ đồng bộ?";

/* Scan bitcoin address camera flash toggle */
"Scanner.flashButtonLabel" = "Đèn Camera";

/* Complete filter label */
"Search.complete" = "hoàn tất";

/* Pending filter label */
"Search.pending" = "đang chờ";

/* Received filter label */
"Search.received" = "đã nhận";

/* Sent filter label */
"Search.sent" = "đã gởi";

/* Face ID button title */
"SecurityCenter.faceIdTitle" = "Face ID";

/* Security Center Info */
"SecurityCenter.info" = "Kích hoạt tất cả các tính năng bảo mật.";

/* Paper Key button description */
"SecurityCenter.paperKeyDescription" = "Cách duy nhất để truy cập ví DigiByte nếu bạn mất hoặc nâng cấp điện thoại.";

/* Paper Key button title */
"SecurityCenter.paperKeyTitle" = "Khoá Khôi Phục ví";

/* PIN button description */
"SecurityCenter.pinDescription" = "Bảo vệ ví DigiWallet của bạn khỏi những người dùng trái phép.";

/* PIN button title */
"SecurityCenter.pinTitle" = "Mật mã 6 số";

/* Security Center Title */
"SecurityCenter.title" = "Bảo mật";

/* Touch ID button description */
"SecurityCenter.touchIdDescription" = "Mở khóa ví DigiWallet của bạn và gửi tiền trong một hạn mức đặt trước.";

/* Touch ID button title */
"SecurityCenter.touchIdTitle" = "Touch ID";

/* Send money amount label */
"Send.amountLabel" = "Số lượng";

/* Balance: $4.00 */
"Send.balance" = "Số dư: %1$@";

/* Camera not allowed message */
"Send.cameraunavailableMessage" = "Mở Settings để cho phép truy cập chức năng chụp ảnh";

/* Camera not allowed alert title */
"Send.cameraUnavailableTitle" = "DigiWallet không được phép truy cập vào máy ảnh";

/* Warning when sending to self. */
"Send.containsAddress" = "Địa chỉ đến là địa chỉ của bạn. Bạn không thể gửi cho chính mình.";

/* Could not create transaction alert title */
"Send.creatTransactionError" = "Giao dịch không thể khởi tạo";

/* Description for sending money label */
"Send.descriptionLabel" = "Ghi chú";

/* Emtpy pasteboard error message */
"Send.emptyPasteboard" = "Không có thông tin nào trong Pasteboard ";

/* Network Fee: $0.01 */
"Send.fee" = "Phí gửi: %1$@";

/* Payee identity not certified alert title. */
"Send.identityNotCertified" = "Người nhận thanh toán không được chứng nhận.";

/* Invalid address alert message */
"Send.invalidAddressMessage" = "Địa chỉ gửi đến không phải là một địa chỉ DigiByte hợp lệ.";

/* Invalid address on pasteboard message */
"Send.invalidAddressOnPasteboard" = "Không có địa chỉ DigiByte hợp lệ nào trong Pasteboard. ";

/* Invalid address alert title */
"Send.invalidAddressTitle" = "Địa chỉ không hợp lệ";

/* Is rescanning error message */
"Send.isRescanning" = "Chức năng gửi bị vô hiệu trong suốt quá trình đồng bộ.";

/* Loading request activity view message */
"Send.loadingRequest" = "Đang tải yêu cầu";

/* Empty address alert message */
"Send.noAddress" = "Hãy nhập địa chỉ của người nhận";

/* Emtpy amount alert message */
"Send.noAmount" = "Hãy nhập số lượng bạn muốn gửi";

/* Paste button label */
"Send.pasteLabel" = "Paste";

/* Could not publish transaction alert title */
"Send.publishTransactionError" = "Không thể  công bố giao dịch.";

/* Could not load remote request error message */
"Send.remoteRequestError" = "Không thể tải yêu cầu thanh toán";

/* Scan button label */
"Send.scanLabel" = "Scan";

/* Send button label (the action, "press here to send") */
"Send.sendLabel" = "Gửi";

/* Send screen title (as in "this is the screen for sending money") */
"Send.title" = "Gửi";

/* Send money to label */
"Send.toLabel" = "Đến";

/* Adress already used alert message - first part */
"Send.UsedAddress.firstLine" = "Các dịa chỉ DigiByte chỉ dành cho một lần sử dụng.";

/* Adress already used alert message - second part */
"Send.UsedAddress.secondLIne" = "Việc tái sử dụng làm giảm sự riêng tư cho cả bạn và người nhận và có thể dẫn đến mất mát nếu người nhận không trực tiếp kiểm soát địa chỉ đó.";

/* Adress already used alert title */
"Send.UsedAddress.title" = "Địa chỉ này đã được sử dụng";

/* About label */
"Settings.about" = "Giới thiệu";

/* Advanced Settings title */
"Settings.advancedTitle" = "Cấu hình nâng cao";

/* i.e. the currency which will be displayed */
"Settings.currency" = "Đơn vị tiền được hiển thị";

/* Join Early access label */
"Settings.earlyAccess" = "Tham gia truy cập sớm";

/* Are you enjoying bread alert message body */
"Settings.enjoying" = "Bạn có hài lòng với DigiWallet không?";

/* Face ID spending limit label */
"Settings.faceIdLimit" = "Hạn mức chi tiêu khi dùng Face ID";

/* Import wallet label */
"Settings.importTitle" = "Nhập Ví vào";

/* Manage settings section header */
"Settings.manage" = "Quản lý";

/* Notifications label */
"Settings.notifications" = "Thông báo";

/* Leave review button label */
"Settings.review" = "Hãy đánh giá chúng tôi";

/* Share anonymous data label */
"Settings.shareData" = "Chia sẻ dữ liệu (nặc danh)";

/* Sync blockchain label */
"Settings.sync" = "Đồng bộ Blockchain";

/* Settings title */
"Settings.title" = "Cài đặt";

/* Touch ID spending limit label */
"Settings.touchIdLimit" = "Hạn mức chi tiêu khi dùng Touch ID";

/* Wallet Settings section header */
"Settings.wallet" = "Ví";

/* Start or recover another wallet menu label. */
"Settings.wipe" = "Khởi tạo/Khôi phục một cái ví khác";

/* Share data view body */
"ShareData.body" = "Giúp cải tiến DigiWallet bằng cách chia sẻ dữ liệu nặc danh của bạn với chúng tôi. Điều này không bao gồm bất kỳ thông tin tài chính nào. Chúng tôi tôn trọng sự riêng tư về tài chính của bạn.";

/* Share data header */
"ShareData.header" = "Chia sẻ dữ liệu";

/* Share data switch label. */
"ShareData.toggleLabel" = "Chia sẻ dữ liệu (nặc danh)";

/* button label */
"StartPaperPhrase.againButtonTitle" = "Viết lại Mã Khôi Phục ví một lần nữa";

/* Paper key explanation text. */
"StartPaperPhrase.body" = "Mã Khóa Khôi Phục ví là cách duy nhất để khôi phục lại Ví DigiWallet của bạn nếu điện thoại bị mất, bị đánh cắp, bị hỏng hoặc nâng cấp.\n \nChúng tôi sẽ cho bạn thấy một danh sách các từ để viết ra trên một miếng giấy và giữ an toàn.";

/* button label */
"StartPaperPhrase.buttonTitle" = "Ghi lại khoá khôi phục ví";

/* Argument is date */
"StartPaperPhrase.date" = "Lần cuối bạn ghi lại khoá khôi phục ví của bạn là %1$@";

/* Start view message */
"StartViewController.message" = "Cách an toàn nhất để sử dụng DigiByte.";

/* labels of syncView */
"SynchingView.blockHeightLabel" = "BLOCK HEIGHT";

"SynchingView.progressLabel" = "PROGRESS";

/* Syncing view connectiong state header text */
"SyncingView.connecting" = "Đang kết nối";

/* Syncing view header text */
"SyncingView.header" = "Đang đồng bộ";

/* Retry button label */
"SyncingView.retry" = "Thử lại";

/* Syncing view syncing state header text */
"SyncingView.syncing" = "Đang đồng bộ";

/* 6 d (6 days) */
"TimeSince.days" = "%1$@ ngày";

/* 6 h (6 hours) */
"TimeSince.hours" = "%1$@ giờ";

/* 6 m (6 minutes) */
"TimeSince.minutes" = "%1$@ phút";

/* 6 s (6 seconds) */
"TimeSince.seconds" = "%1$@ giây";

/* You can customize your Touch ID Spending Limit from the [TouchIdSettings.linkText gets added here as a button] */
"TouchIdSettings.customizeText" = "Bạn có thể tùy chỉnh hạn mức chi tiêu của Touch ID từ %1$@.";

/* Touch Id screen label */
"TouchIdSettings.label" = "Sử dụng vân tay của bạn để mở khóa ví DigiWallet và gửi tiền trong một hạn mức được đặt trước";

/* Link Text (see TouchIdSettings.customizeText) */
"TouchIdSettings.linkText" = "Màn hình chỉnh hạn mức chi tiêu của Touch ID ";

/* Spending Limit: b100,000 ($100) */
"TouchIdSettings.spendingLimit" = "Hạn mức chi tiêu: %1$@ (%2$@)";

/* Touch id switch label. */
"TouchIdSettings.switchLabel" = "Bật Touch ID cho ví DigiWallet";

/* Touch ID settings view title */
"TouchIdSettings.title" = "Touch ID";

/* Touch ID unavailable alert message */
"TouchIdSettings.unavailableAlertMessage" = "Bạn chưa thiết lập Touch ID trên thiết bị này. Hãy mở Cài đặt -> Touch ID & Mật mã để thiết lập nó ngay bây giờ.";

/* Touch ID unavailable alert title */
"TouchIdSettings.unavailableAlertTitle" = "Touch ID chưa được khởi tạo";

/* Always require passcode option */
"TouchIdSpendingLimit" = "Luôn yêu cầu mật mã";

/* Touch ID spending limit screen body */
"TouchIdSpendingLimit.body" = "Bạn sẽ được yêu cầu nhập mật mã gồm 6 chữ số để gửi bất kỳ giao dịch nào vượt quá hạn mức chi tiêu của bạn, hoặc mỗi 48 giờ kể từ lần cuối cùng bạn nhập mật mã.";

/* Touch Id spending limit screen title */
"TouchIdSpendingLimit.title" = "Hạn mức chi tiêu dùng Touch ID";

/* Availability status text */
"Transaction.available" = "Mức có thể chi tiêu";

/* Transaction complete label */
"Transaction.complete" = "Hoàn tất";

/* eg. Ending balance: $50.00 */
"Transaction.ending" = "Số dư: %1$@";

/* Exchange rate on date header */
"Transaction.exchangeOnDayReceived" = "Tỷ giá khi nhận:";

/* Exchange rate on date header */
"Transaction.exchangeOnDaySent" = "Tỷ giá khi gởi:";

/* (b600 fee) */
"Transaction.fee" = "(%1$@ phí)";

/* Invalid transaction */
"Transaction.invalid" = "INVALID";

/* Timestamp label for event that just happened */
"Transaction.justNow" = "Ngay bây giờ";

/* Receive status text: 'In progress: 20%' */
"Transaction.receivedStatus" = "Đang xảy ra: %1$@";

/* Send status text: 'In progress: 20%' */
"Transaction.sendingStatus" = "Đang xảy ra: %1$@";

/* eg. Starting balance: $50.00 */
"Transaction.starting" = "Số bắt đầu: %1$@";

/* Waiting to be confirmed string */
"Transaction.waiting" = "Đang đợi để được xác nhận. Một số người bán yêu cầu xác nhận để hoàn tất giao dịch. Thời gian ước tính: 1-2 phút.";

/* e.g. I received money from an account. */
"TransactionDetails.account" = "tài khoản";

/* Amount section header */
"TransactionDetails.amountHeader" = "Số lượng";

/* Block height label */
"TransactionDetails.blockHeightLabel" = "Xác nhận trong Block";

/* Memo section header */
"TransactionDetails.commentsHeader" = "Ghi chú";

/* Empty transaction list message. */
"TransactionDetails.emptyMessage" = "Giao dịch của bạn sẽ hiển thị tại đây.";

/* "Received [$5] at [which of my addresses]" => This is the "at [which of my addresses]" part. */
"TransactionDetails.from" = "tại %1$@";

/* More button title */
"TransactionDetails.more" = "Thêm nữa...";

/* Moved $5.00 (as in "I moved $5 to another location") */
"TransactionDetails.moved" = "Đã chuyển %1$@";

/* Moved $5.00 */
"TransactionDetails.movedAmountDescription" = "Đã chuyển <b>%1@</b>";

/* eg. Confirmed in Block: Not Confirmed */
"TransactionDetails.notConfirmedBlockHeightLabel" = "Chưa xác nhận";

/* "Received [$5] at [which of my addresses]" => This is the "Received [$5]" part. */
"TransactionDetails.received" = "Đã nhận %1$@";

/* Received $5.00 */
"TransactionDetails.receivedAmountDescription" = "Đã nhận <b>%1@</b>";

/* "Sent [$5] to [address]" => This is the "Sent [$5]" part. */
"TransactionDetails.sent" = "Đã gởi %1$@";

/* Sent $5.00 */
"TransactionDetails.sentAmountDescription" = "Đã gởi <b>%1@</b>";

/* Status section header */
"TransactionDetails.statusHeader" = "Trạng thái";

/* Transaction Details Title */
"TransactionDetails.title" = "Chi tiết giao dịch";

/* "Sent [$5] to [address]" => This is the "to [address]" part. */
"TransactionDetails.to" = "đến %1$@";

/* Transaction ID header */
"TransactionDetails.txHashHeader" = "ID của giao dịch DigiByte";

/* (this transaction was) Received at this address: */
"TransactionDirection.address" = "Đã nhận tại địa chỉ này";

/* (this transaction was) Sent to this address: */
"TransactionDirection.to" = "Đã gửi đến địa chỉ này";

/* filter buttons for transactionView */
"TransactionView.all" = "all";

"TransactionView.received" = "received";

"TransactionView.sent" = "sent";

/* Disabled until date */
"UnlockScreen.disabled" = "Không dùng được đến: %1$@";

/* My Address button title */
"UnlockScreen.myAddress" = "Địa chỉ của tôi";

/* Reset PIN with Paper Key button label. */
"UnlockScreen.resetPin" = "Đặt lại mật mã";

/* Scan button title */
"UnlockScreen.scan" = "Scan";

/* Unlock Screen sub-header */
"UnlockScreen.subheader" = "Nhập mật mã";

/* TouchID prompt text */
"UnlockScreen.touchIdPrompt" = "Mở khóa DigiWallet của bạn.";

/* Unlock with TouchID accessibility label */
"UnlockScreen.touchIdText" = "Mở khoá dùng TouchID";

/* Wallet unlocked message */
"UnlockScreen.unlocked" = "Ví đã được mở";

/* Update PIN caption text */
"UpdatePin.caption" = "Hãy ghi nhớ mật mã này. Nếu bạn quên nó, bạn sẽ không thể truy cập DigiByte của bạn.";

/* PIN creation info. */
"UpdatePin.createInstruction" = "Mật mã của bạn sẽ được sử dụng để mở khóa ví DigiWallet của bạn và gửi tiền.";

/* Update PIN title */
"UpdatePin.createTitle" = "Đặt mật mã";

/* Update PIN title */
"UpdatePin.createTitleConfirm" = "Nhập lại mật mã";

/* Enter current PIN instruction */
"UpdatePin.enterCurrent" = "Nhập mật mã đang dùng";

/* Enter new PIN instruction */
"UpdatePin.enterNew" = "Nhập mật mã mới";

/* Re-Enter new PIN instruction */
"UpdatePin.reEnterNew" = "Nhập lại mật mã mới";

/* Update PIN failure error message. */
"UpdatePin.setPinError" = "Xin lỗi, mật mã mới không cập nhật được";

/* Update PIN failure alert view title */
"UpdatePin.setPinErrorTitle" = "Lỗi khi cập nhật mật mã";

/* Update PIN title */
"UpdatePin.updateTitle" = "Cập nhật mật mã";

/* Authorize to copy wallet addresses alert message */
"URLHandling.addressaddressListAlertMessage" = "Sao chép địa chỉ ví vào Clipboard?";

/* Authorize to copy wallet address PIN view prompt. */
"URLHandling.addressList" = "Cho phép copy địa chỉ của ví vào clipboard";

/* Authorize to copy wallet address alert title */
"URLHandling.addressListAlertTitle" = "Sao chép địa chỉ ví";

/* Copy wallet addresses alert button label */
"URLHandling.copy" = "Sao chép";

/* Verify PIN for transaction view body */
"VerifyPin.authorize" = "Hãy nhập mật mã của bạn để xác thực giao dịch này";

/* Verify PIN view body */
"VerifyPin.continueBody" = "Hãy nhập mật mã của bạn để tiếp tục";

/* Verify PIN view title */
"VerifyPin.title" = "Cần nhập mật mã";

/* Authorize transaction with touch id message */
"VerifyPin.touchIdMessage" = "Xác thực giao dịch này";

/* 'No wallet' warning for watch app */
"Watch.noWalletWarning" = "Mở ứng dụng DigiWallet iPhone để thiết lập ví của bạn.";

/* Dismiss button label */
"Webview.dismiss" = "Bỏ";

/* Webview loading error message */
"Webview.errorMessage" = "Đã xãy ra lỗi khi đang tải nội dung. Vui lòng thử lại";

/* Updating webview message */
"Webview.updating" = "Đang cập nhật...";

/* Welcome screen text. (?) will be replaced with the help icon users should look for. */
"Welcome.body" = "DigiByte dành cho iOS đã đổi tên thành DigiWallet, với một giao diện hoàn toàn mới và một số tính năng mới.\n \nNếu bạn cần trợ giúp, hãy tìm kiếm (?) Ở trên cùng bên phải của hầu hết các màn hình.";

/* Top title of welcome screen */
"Welcome.title" = "Chào mừng bạn đến với DigiWallet!";

/* Wipe wallet alert message */
"WipeWallet.alertMessage" = "Bạn có chắc chắn là muốn xoá cái ví này?";

/* Wipe wallet alert title */
"WipeWallet.alertTitle" = "Xoá Ví";

/* Failed wipe wallet alert message */
"WipeWallet.failedMessage" = "Không thể xoá  được ví";

/* Failed wipe wallet alert title */
"WipeWallet.failedTitle" = "Thất bại";

/* Enter phrase to wipe wallet instruction. */
"WipeWallet.instruction" = "Nhập cụm từ phục hồi của ví này để xóa và bắt đầu hoặc khôi phục lại tài khoản khác. Số dư hiện tại của bạn vẫn còn trên ví này.";

/* Start wipe wallet view message */
"WipeWallet.startMessage" = "Tạo mới hoặc khôi phục một chiếc ví khác cho phép bạn truy cập và quản lý một ví DigiWallet khác trên thiết bị này.";

/* Start wipe wallet view warning */
"WipeWallet.startWarning" = "Bạn sẽ không còn có thể truy cập vào ví DigiWallet hiện tại của bạn từ thiết bị này. Số dư của bạn sẽ vẫn còn trên ví đó.";

/* Wipe wallet navigation item title. */
"WipeWallet.title" = "Tạo mới hoặc khôi phục một ví khác";

/* Wipe wallet button title */
"WipeWallet.wipe" = "Xoá";

/* Wiping activity message */
"WipeWallet.wiping" = "Đang xoá...";

/* Paper key instructions. */
"WritePaperPhrase.instruction" = "Viết mỗi từ theo thứ tự và cất giữ ở nơi an toàn.";

/* button label */
"WritePaperPhrase.next" = "Kế tiếp";

/* button label */
"WritePaperPhrase.previous" = "Trước đó";

/* 1 of 3 */
"WritePaperPhrase.step" = "%1$d trong %2$d";

